{"pages":[{"title":"About","text":"일상에서 소소한 행복을 찾고 있는 Teddy입니다. 직업은 소프트웨어 개발자이고 정년까지 이 직업을 유지하고 싶은 엄청난 꿈을 꾸기도 합니다.하루하루 소소한 행복을 느끼며 지내다 보면 언젠가는 꿈을 이룰 수 있겠죠? 이곳은 다락방 같은 공간입니다.시간 날 때 잠깐 올라와서 사색도 하고 좋아하는 것, 관심 있는 것, 필요한 것들을 잘 정리해서 보관하려고 합니다.","link":"/about/index.html"}],"posts":[{"title":"Close To You - Carpenters","text":"Just like me, they long to be close to you나처럼, 그들도 당신 곁에 머물고 싶은가 봐요 Couch Choir - (They Long To Be) Close To You Pub Choir 채널에서는 “Close To You” 노래하는 영상을 모집했고 단 이틀만에 18개 나라의 1000명 이상의 사람들이 영상을 제출했다.","link":"/2020/04/07/Close-To-You-Carpenters/"},{"title":"Lua","text":"Introduce 루아(Lua) 프로그래밍 언어는 가벼운 명령형/절차적 언어로, 확장 언어로 쓰일 수 있는 스크립팅 언어를 주 목적으로 설계되었다. 루아 프로그램은 직접적으로 인터프리트되지 않고, 바이트 코드로 컴파일되어 루아 가상 머신에서 실행 된다. 루아는 “달”을 의미하는 포르투갈어이다. 루아는 특히 게임에서 많이 사용된다. Install$ brew install lua Hello World lua를 실행하고 터미널에서 직접 타이핑하면 코드가 인터프리터에 의한 실행됨 $ luaLua 5.3.5 Copyright (C) 1994-2018 Lua.org, PUC-Rio&gt; print(\"Hello Lua\")Hello Lua 파일로 코드를 작성하여 실행하는 방법 $ which lua/usr/local/bin/lua$ vi hello.lua#!/usr/local/bin/luaprint(\"Hello Lua\")$ chmod +x hello.lua$ ./hello.luaHello Lua Learn LuaLearn Lua in 15 Minutes Learn Lua in 15 Minutes (번역본)루아 15분 안에 배우기 Learn Lua in an Hour Video Scripts Appendix 공식 웹사이트 웹으로 코드를 실행해 볼 수 있는 페이지 위키 - 루아 (프로그래밍 언어)","link":"/2020/04/12/Lua/"},{"title":"Still Fighting It - Ben Folds","text":"And you’re so much like me넌 날 참 많이 닮았구나I’m sorry그래서 미안해 아들과 아버지가 생각나는 노래벤 폴즈가 아들 루이스를 생각하며 만든 곡으로 성장을 통해 받게 되는 고통과 아들을 보며 느끼는 감정을 전하고 있다. 내 아버지와 나, 그리고 내 아들.내 아버지가 나와 같은 생각을 하셨겠구나. 내 아들도 아버지가 되면 내 생각을 하며 아들을 걱정하고 있겠구나.이런 생각하면 아련하고 목이 메인다. 20년쯤 지나서너와 함께 앉아 맥주를 마시게 된다면오늘에 대해 말해줄게내가 너를 들었을 때 모든 것이 달라졌다고고통이었지맑은 날도, 비가 내리는 날도너가 나와 같은 감정을 느꼈다는 걸 알았어다들 알고 있어어른이 된다는 건 아픈 일이라는 걸그래도 다들 견뎌 내다시 여기로 돌아오니 기분이 이상하구나네게 해줄 말이 있어세월이 흘러도우린 계속 싸워야 한다는 걸넌 노력하고 또 노력하겠지, 그리고 어느 날나에게서 멀리 날아가겠지 - Still Fighting It 가사 중에서 가사 해석 이태원 클라쓰 OST이 드라마를 통해 이 곡을 처음 알게 되었고, 노래를 부른 이찬솔이 슈퍼밴드에서 팀으로 부른 노래란 것도 알게 되었다. 슈퍼밴드 윤종신 심사평윤종신이 “세상은 기본적으로 불행하고, 덜 불행하기 위해 노력하는 게 인생이라고 생각하거든요” 라고 했는데 요즘들어 더 공감이 간다.","link":"/2020/04/19/Still-Fighting-It/"},{"title":"Incoming Webhook으로 Microsoft Teams 채널에 메시지 보내기","text":"Microsoft Teams의 Incoming Webhook을 사용해서 채널에 메시지 전송하는 방법을 정리 채널에 Incoming Webhook 추가하기채널에 Incoming Webhook을 추가하는 방법은 다음과 같다. Webhook을 추가할 채널로 이동하여 상단 네비게이션 바 오른쪽에 (•••) 모양의 옵션을 클릭 드롭다운 메뉴에서 커넥터를 클릭하고 Incoming Webhook을 검색하여 구성 버튼을 클릭 이름을 입력한 후에 만들기 버튼 클릭 다이얼로그에 webhook URL이 나타나면 URL을 복사하여 클립보드에 저장한 다음 완료 버튼 클릭 Incoming Webhook에 메시지 보내기webhook URL에 POST 메소드로 JSON 페이로드를 요청한다. JSON payload{ \"@type\": \"MessageCard\", \"@context\": \"http://schema.org/extensions\", \"themeColor\": \"0076D7\", \"summary\": \"Larry Bryant created a new task\", \"sections\": [{ \"activityTitle\": \"![TestImage](https://47a92947.ngrok.io/Content/Images/default.png)Larry Bryant created a new task\", \"activitySubtitle\": \"On Project Tango\", \"activityImage\": \"https://teamsnodesample.azurewebsites.net/static/img/image5.png\", \"facts\": [{ \"name\": \"Assigned to\", \"value\": \"Unassigned\" }, { \"name\": \"Due date\", \"value\": \"Mon May 01 2017 17:07:18 GMT-0700 (Pacific Daylight Time)\" }, { \"name\": \"Status\", \"value\": \"Not started\" }], \"markdown\": true }]} 텍스트 타입의 필드는 마크다운 문법이 자동으로 적용되는데 Plain 텍스트로 적용하고 싶다면 &quot;markdown&quot;: false로 보내면 된다. curl로 테스트: curlcurl -X POST -H 'Content-Type: application/json' \\ -d '&lt;JSON payload&gt;' &lt;YOUR WEBHOOK URL&gt; 메시지 카드요청이 성공하면 채널에 아래 이미지와 같은 메시지가 수신된다. 참고 Post external requests to Teams with incoming webhooks Sending messages to connectors and webhooks","link":"/2020/04/20/send-message-to-Microsoft-Teams-with-Incoming-Webhook/"},{"title":"wrk - 간편하고 가벼운 HTTP 벤치마킹 도구","text":"wrk는 HTTP 웹 애플리케이션 벤치마킹 용도로 사용하는 CLI 도구이다. 설치와 사용법이 간단하고 시스템 리소스를 적게 사용하기 때문에 빠르고 간편하게 사용할 수 있다. 설치와 사용법이 간단하다.설치brew install wrk 사용법wrk -t20 -c200 -d60s http://localhost:8080/http.json -t20: Thread 20개가 실행되어 -c200: HTTP Connection 200개를 서버에 연결하고 (각 Thread 별로 10개의 Connection 연결) -d60s: 60초동안 지속적으로 트래픽 발생 실행 결과: Running 1m test @ http://localhost:8080/http.json 20 threads and 200 connections Thread Stats Avg Stdev Max +/- Stdev Latency 61.21ms 6.23ms 137.15ms 83.77% Req/Sec 164.12 42.84 300.00 69.83% 196134 requests in 1.00m, 103.06MB read Socket errors: connect 0, read 66, write 0, timeout 0Requests/sec: 3263.40Transfer/sec: 1.71MB Latency 61.21ms 6.23ms 137.15ms 83.77%: 응답시간 평균은 61.21ms, 표준편차는 6.23ms, 최대값은 137.15ms, 표준편차 1 범위에 들어가는 확률은 83.77% (Stdev가 낮을수록 +/- Stdev가 높을수록 응답시간이 안정적이라고 볼 수 있음) 196134 requests in 1.00m, 103.06MB read: 1분 동안 196,314번의 요청을 보냈고 103.06MB데이터를 읽음 Reqeusts/sec: 3263.40: 초당 3,263번의 요청을 보내서 응답을 받음 추가 옵션 -H, --header: HTTP 헤더 추가. e.g. “User-Agent: wrk” -s, --script: LuaJIT 스크립트 추가. SCRIPTING 참고 --latency: Latency 통계 출력 --timeout: 타임아웃 값 설정. 기본값 2초 프로그램이 가볍다.Thread와 Connection을 늘리면서 top로 프로세스 상태를 확인해 봤다. top (Thread: 20, Connection: 200 실행 시) PID COMMAND %CPU TIME #TH #WQ #POR MEM PURG CMPR PGRP40294 wrk 6.0 00:01.66 21 0 38 3512K 0B 0B 40294 top (Thread: 100, Connection: 1,000 실행 시) PID COMMAND %CPU TIME #TH #WQ #POR MEM PURG CMPR PGRP45743 wrk 6.9 00:04.04 101 0 118 22M 0B 0B 45743 top (Thread: 500, Connection: 5,000 실행 시) PID COMMAND %CPU TIME #TH #WQ #POR MEM PURG CMPR PGRP46541 wrk 11.8 00:05.13 501 0 518 285M+ 0B 0B 46541 동시 요청 수를 5,000까지 늘렸을 때 CPU는 10% 대를 유지하였고 메모리는 요청 수에 따라 리니어하게 증가했지만 285M 정도에 그쳤다. 경험상 LoadRunner, JMeter, nGrinder 등의 성능테스트 도구는 동시 요청 수에 제약이 있거나 많은 리소스를 필요로 하는 것에 비해 wrk의 리소스 사용량은 매우 적다. (혜자다) 그런데 말입니다.사용하다보니 부족한 기능이 보이기 시작했다. (인간의 욕심은 끝이 없고 같은 실수를 반복한다) URL 하나만 요청이 가능하네? POST 메소드 요청은 보낼 수 없나? 요청 사이에 delay 시간을 조금 주고 싶은데? 여기서 끝내야 했는데 사용법에 나온 LuaJIT 스크립트를 사용하면 될 것 같은 느낌이 온다.어? 샘플 스크립트도 있다.근데 막상 원하는 걸 하려는데 잘 안된다.계속 삽집할 것 같은 느낌도 온다. 삽질이 끝나면 LuaJIT 활용기도 남기겠다.","link":"/2020/04/18/wrk-a-HTTP-benchmarking-tool/"},{"title":"재택근무를 위한 업무용 데스크 구성","text":"재택근무코로나19로 인해 2월 마지막 주부터 재택근무를 시작했다. 재택근무 이전에는 서재에 책상과 간이 의자만 있고 흔한 모니터 하나 없었다. 하지만 업무가 시작되면서 불편한 게 한두 가지가 아니었고, 필요한 것부터 하나하나 장만하다 보니 지금의 모습을 갖추게 되었다. 데스크 구성 책상데스커 모션 데스크 스위치로 간편하게 높이 조절을 할 수가 있어서 앉거나 서서 일할 수 있다. 일하다가 몸이 뻐근해질 때가 있는데 잠시 책상 높이를 올리고 서서 업무를 진행하는 용도로 사용한다. 책상 앞쪽 하단에 멀티탭과 전선들을 수납할 수 있는 보이지 않는 선반이 있어서 책상 위가 깔끔해진다. 노트북애플 MacBook Pro (15인치, 2017) 회사에서 사용하고 있는 노트북으로 회사에서 가져온 유일한 구성품이기도 하다. 키보드레오폴드 FC750R 집에서 쓰려고 작년에 중고로 구매하고 사용 빈도가 적었는데 이번에 아주 유용하게 사용하고 있다. 모니터LG 32QK500C 노트북 15인치 화면 하나로 업무를 처리하기엔 효율이 떨어져서 모니터가 하나 필요했다. 책상 면적이 넓은 편이 아니어서 모니터를 1대만 놓을 거라 24인치보다는 32인치로 골랐고 4K보다는 QHD(2560 x 1440)가 글씨 크기가 적당하게 보일 거 같았다. 모니터 암에 설치할 거라 월 마운트 가능한 모델로 선택했다. 처음엔 크기가 커서 적응이 안 되었는데 차츰 윈도우 크기와 배치를 조절하며 적응해 가고 있다. 모니터 암카멜마운트 PMA-2U 높낮이 조절 책상을 쓰다 보니 모니터 스탠드보다는 암을 쓰는 게 적합할 거라 생각했고 32인치에 맞는 모델을 찾아서 구매했는데 높이 조절, 틸트, 피벗까지 가능하고 케이블이 보이지 않게 덮개가 있어서 선 정리도 깔끔하게 되었다. 도킹 스테이션벤션 USB 타입 C 허브 9 in 1 맥북에 USB 타입 C 포트만 있기 때문에 모니터와 키보드를 연결하려면 각자 타입 C 케이블이 필요하고 포트마다 연결해야 해서 깔끔하지가 않다. 그래서 허브 하나로 전원, HDMI, USB 연결을 할 수 있는 것으로 구매 스피커오디오엔진 A2+ Wireless 업무에 꼭 필요한 건 아니지만 예전부터 PC-Fi 용으로 사고 싶었던 모델이기도 하고 좋은 음악과 음질로 자신을 힐링하기 위해 구매하였다. 노트북 + 모니터 + 스피커 조합으로 영화나 유튜브 보기에도 너무 좋다. 입력은 AUX, USB, 블루투스(aptX-LL 지원) 3가지 동시에 지원해서 활용도가 높다. 트랙패드애플 Magic TrackPad 2 맥을 제대로 쓰려면 마우스보다는 트랙패드 추천. 손목이나 손가락 관절에 무리가 덜 간다. AI 스피커구글 홈 미니 날씨 물어보고 아침 뉴스 듣는 용도로 쓰고 있다. 음악, 영화 감상용 스피커로는 비추 의자에이픽스 GC001 ARGENTINA 스탠딩 책상이 있어서 의자가 불편해도 괜찮겠다 생각했는데 등받이 없는 간이 의자로는 역시 무리가 있었다. 특히 목과 어깨 통증이 심해져서 의자를 알아봤다. 딱히 사고 싶은 후보가 없었는데 회사 동료 추천으로 알아보다가 가성비와 디자인이 괜찮고 팔걸이 조절되는 것이 맘에 들어서 구매했다. 의자가 바뀌니 어깨와 목 통증이 줄어들었다. 가장 빨리 구매했어야 하는 품목이 의자인데 실상은 가장 늦게 구매한 품목이 됐다. 총평재택근무 한 달만에 완성이 되긴 했지만 지금의 데스크 구성이 꽤나 맘에 든다. 단 기간에 지출은 좀 있었지만 재택근무가 아니더라도 집에서 공부하거나 음악, 영상을 감상하는 공간으로 활용할 거라 적당한 투자라고 생각한다.","link":"/2020/04/04/%EC%9E%AC%ED%83%9D%EA%B7%BC%EB%AC%B4%EB%A5%BC-%EC%9C%84%ED%95%9C-%EC%97%85%EB%AC%B4%EC%9A%A9-%EB%8D%B0%EC%8A%A4%ED%81%AC-%EA%B5%AC%EC%84%B1/"},{"title":"Spring Cloud Gateway 소개","text":"오픈소스 API Gateway 솔루션으로 유명한 Spring Cloud Netflix가 유지보수 모드로 바뀌면서 새로운 대안인 Spring Cloud Gateway를 소개해 본다. Spring Cloud Netflix - 유지보수 모드스프링 클라우드 팀은 Spring Cloud Netflix 프로젝트가 Eureka와 concurrency-limits 모듈을 제외한 나머지 모듈1에 대해서 유지보수 모드2에 들어간다고 2018년 12월에 발표했다.대상 모듈에 대해서는 새로운 기능은 추가하지 않고 버그나 보안 이슈에 대해서만 향후 1년 간 지원을 하겠다는 내용이다. 그리고 유지보수 모듈을 대체할 수 있는 모듈도 함께 언급했다. Current Replacement Hystrix Resilience4j Hystrix Dashboard / Turbine Micrometer + Monitoring System Ribbon Spring Cloud Loadbalancer Zuul 1 Spring Cloud Gateway Archaius 1 Spring Boot external config + Spring Cloud Config Spring Cloud GatewayReference 사이트에 들어가면 다음과 같은 소개 문구가 보인다. This project provides an API Gateway built on top of the Spring Ecosystem, including: Spring 5, Spring Boot 2 and Project Reactor. Spring Cloud Gateway aims to provide a simple, yet effective way to route to APIs and provide cross cutting concerns to them such as: security, monitoring/metrics, and resiliency. (번역해 보면) 이 프로젝트는 Spring 5, Spring Boot 2 및 Project Reactor4를 포함하여 스프링 생태계 위에 구축된 API Gateway를 제공합니다. Spring Cloud Gateway의 목표는 간단하지만 효과적인 API 라우팅 방법을 제공하고 보안, 모니터링/메트릭 및 복원력과 같은 횡단 관심사3를 제공하는 것입니다. API Gateway에서 필요한 API 라우팅과 보안, 모니터링, 복원과 같은 공통 기능을 제공하고 있고 Project Reactor를 사용하여 Non-Blocking 방식의 프로그래밍이 필요해 보인다. 어떻게 동작하나?다음 다이어그램을 보고 SCG가 어떤 방식으로 동작하는지 살펴보자. Client가 SCG에 요청 Gateway Handler Mapping은 요청이 route와 일치한다고 판단하면 Gateway Web Handler로 전달 Gateway Web Handler는 요청과 관련된 filter chain을 통해 요청을 실행 Filter가 점선으로 구분되는 이유는 프록시 요청이 전송되기 전과 후에 필터 로직을 실행할 수 있기 때문 filter chain에 있는 Pre 필터 로직이 실행 대상 서비스로 프록시 요청을 수행 프록시 요청이 이루어진 후 Post 필터 로직이 실행 Client에 응답 개념은 간단하고, 여기에 3가지 용어만 이해하면 된다. 1. Route(라우트) Client의 요청에 대해 어떤 조건(Predicate)으로 일치하는지 판단하고 어떤 필터(Filter) 로직을 실행하고 어떤 서비스로 프록시 요청을 할지를 SCG에 설정을 해줘야 한다. 이러한 설정의 기본 단위 블록이 Route이고 ID, 대상 서비스 URI, Predicate 모음 및 Filter 모음으로 정의된다. Predicate가 true이면 요청이 해당 route와 일치한다고 판단한다. 2. Predicate(조건부) Java 8 Function Predicate를 사용 input 파라미터 타입은 Spring Framework ServerWebExchange Predicate를 통해서 HTTP 요청의 대부분의 케이스에 대해서 매칭시킬 수가 있다. Request Header, Host, Method, Cookie, Path, Query 등등 SCG는 다양한 Route Predicate Factory를 탑재하고 있다. 여러 개 Predicate를 결합해서 사용할 수 있다. 3. Filter(필터) 특정 팩토리로 구성된 Spring Framework GatewayFilter 인스턴스들 프록시 요청 전과 후로 Request와 Response를 수정할 수 있다. SCG는 다양한 GatewayFilter Factory를 탑재하고 있다. 여러 개 GatewayFilter를 결합해서 사용할 수 있다. 좀 더 자세한 예제는 Unit Tests에서 볼 수 있다. 어떻게 사용하나?SCP는 Spring Boot Starter를 제공하며, SpringInitializr 에서 Gateway를 검색해서 dependency를 추가할 수가 있다. Route 설정 방법은 간단한 예제로 설명한다. 요청 Host가 somehost.org 또는 anotherhost.org 도메인이면(서브 도메인 포함) 요청 Header에 X-Request-Red:Blue 헤더를 추가하고 http://httpbin.org URI로 프록시 요청을 처리 application.yml 설정으로 다음과 같이 간단하게 라우트를 설정할 수 있다. application.ymlspring: cloud: gateway: routes: - id: sample_host_route uri: http://httpbin.org predicates: - Host=**.somehost.org,**.anotherhost.org filters: - AddRequestHeader=X-Request-Red, Blue spring.cloud.gateway.routes 속성에 라우팅 정의를 리스트 단위로 설정할 수 있다. id: Route를 식별하기 위해 사용 uri: 프록시 요청할 서비스 URI predicates: 조건부로 요청 Host의 매칭 패턴을 설정 filters: 필터로 요청 Header에 X-Request-Red를 추가하는 설정 로컬에 애플리케이션을 구동하고 curl로 간단하게 요청을 보내보자. curl localhost:5000/get -H \"Host: sub.somehost.org\" 아래는 httpbin.org5로 프록시 요청을 보내고 받은 응답이다. { \"args\": {}, \"headers\": { \"Accept\": \"*/*\", \"Content-Length\": \"0\", \"Forwarded\": \"proto=http;host=sub.somehost.org;for=\\\"0:0:0:0:0:0:0:1:55265\\\"\", \"Host\": \"httpbin.org\", \"User-Agent\": \"curl/7.64.1\", \"X-Amzn-Trace-Id\": \"Root=1-5e46010b-12079ee0a736019898c14ea0\", \"X-Forwarded-Host\": \"sub.somehost.org\", \"X-Request-Red\": \"Blue\" }, \"origin\": \"0:0:0:0:0:0:0:1, 211.174.55.156\", \"url\": \"http://sub.somehost.org/get\"} 응답에 SCG가 httpbin.org로 보낸 요청 헤더들을 볼 수가 있는데 필터에 추가한 X-Request-Red가 보인다. console2020-02-14 11:08:11.616 DEBUG 46785 --- [ctor-http-nio-4] o.s.c.g.h.RoutePredicateHandlerMapping : Route matched: sample_host_route2020-02-14 11:08:11.617 DEBUG 46785 --- [ctor-http-nio-4] o.s.c.g.h.RoutePredicateHandlerMapping : Mapping [Exchange: GET http://sub.somehost.org/get] to Route{id='sample_host_route', uri=http://httpbin.org:80, order=0, predicate=Hosts: [**.somehost.org, **.anotherhost.org], gatewayFilters=[[[AddRequestHeader X-Request-Red = 'Blue'], order = 1]], metadata={}} 로그를 보면 sample_host_route Route에 매치되었다고 나오고 다음 줄에는 세부적인 내용들이 나온다. application 프로퍼티 외에 Java Configuration으로 설정이 가능하다. 아래는 application.yml에 설정한 것과 같은 처리를 한다. RouteConfiguration.java@Configurationpublic class RouteConfiguration { @Bean public RouteLocator customRouteLocator(RouteLocatorBuilder builder) { return builder.routes() // Sample .route(\"sample_host_route\", r -&gt; r.host(\"**.somehost.org,**.anotherhost.org\") .filters(f -&gt; f.addRequestHeader(\"X-Request-Red\", \"Blue\")) .uri(\"http://httpbin.org\")) .build(); }} 이 외에도 전체 Route에 공통으로 필터를 적용할 수 있는 Global Filter가 있다. 커스터마이징은 가능한가?Yes! Predicate, GatewayFilter에 대해서 커스텀이 가능하다. 아래에 개발자를 위한 가이드 링크가 있다. 17.1. Writing Custom Route Predicate Factories 17.2. Writing Custom GatewayFilter Factories 17.3. Writing Custom Global Filters 요청 IP에 대한 화이트리스트 제어를 Global Filter를 만들어서 적용해 봤는데 잘 되었다.GlobalFilter를 구현한 클래스를 만들고 Configuration에 빈으로 추가하면 된다.아래에 만든 코드가 있으니 자세한 설명은 생략한다. GlobalFilterConfiguration.java@Configurationpublic class GlobalFilterConfiguration { @Bean public GlobalFilter whitelistGlobalFilter(WhitelistChecker whitelistChecker) { return new WhitelistGlobalFilter(whitelistChecker); }} WhitelistGlobalFilter.java@Slf4jpublic class WhitelistGlobalFilter implements GlobalFilter, Ordered { private final WhitelistChecker whitelistChecker; public WhitelistGlobalFilter(WhitelistChecker whitelistChecker) { this.whitelistChecker = whitelistChecker; } @Override public Mono&lt;Void&gt; filter(ServerWebExchange exchange, GatewayFilterChain chain) { // verify request remote address String remoteAddress = getRemoteAddress(exchange); if (whitelistChecker.blocked(remoteAddress)) { ServerHttpResponse response = exchange.getResponse(); response.setStatusCode(HttpStatus.FORBIDDEN); return response.setComplete(); } return chain.filter(exchange); } private String getRemoteAddress(ServerWebExchange exchange) { RemoteAddressResolver resolver = XForwardedRemoteAddressResolver.maxTrustedIndex(1); return resolver.resolve(exchange).getAddress().getHostAddress(); } @Override public int getOrder() { return -1; }} 운영 환경에서 사용할만 한가?이 부분은 실제 운영 환경에서 풀어나가야 할 숙제이다.실제 운영환경에서 사용하려면 성능, 안정성, 운영 등에 대한 여러가지 요건이 필요하기 때문에 요건을 도출하고 실행 및 테스트를 진행해야 한다. 기회가 되면 이 부분에 대해서 정리해 보고자 한다. 1.유지보수 대상 모듈: archaius, hystrix-contract, hystrix-dashboard, hystrix-stream, hystrix, ribbon, turbine-stream, turbine, zuul ↩2.모듈을 유지보수 모드로 설정하면 스프링 클라우드 팀은 모듈에 새로운 기능을 추가하지 않고, 버그 및 보안 문제를 해결하고, 커뮤니티의 작은 PR만 검토한다. ↩3.횡단 관심사(cross cutting concerns): 애플리케이션에서 로깅, 트랜잭션, 보안과 같이 다수의 모듈에서 반복적으로 나타나는 부분이 존재하는데 이것을 횡단 관심사 라고 한다. ↩4.피보탈의 오픈소스 프로젝트로 JVM에서 동작하는 Non-blocking 애플리케이션을 만들기 위한 리액티브 라이브러리 ↩5.httpbin.org는 Request 내용을 JSON 응답으로 보내주기 때문에 HTTP 테스트용으로 사용하는 서비스 ↩","link":"/2020/04/10/Spring-Cloud-Gateway/"}],"tags":[{"name":"올드팝","slug":"올드팝","link":"/tags/%EC%98%AC%EB%93%9C%ED%8C%9D/"},{"name":"카펜터스","slug":"카펜터스","link":"/tags/%EC%B9%B4%ED%8E%9C%ED%84%B0%EC%8A%A4/"},{"name":"TIL","slug":"TIL","link":"/tags/TIL/"},{"name":"Lua","slug":"Lua","link":"/tags/Lua/"},{"name":"Still Fighting It","slug":"Still-Fighting-It","link":"/tags/Still-Fighting-It/"},{"name":"Ben Folds","slug":"Ben-Folds","link":"/tags/Ben-Folds/"},{"name":"이찬솔","slug":"이찬솔","link":"/tags/%EC%9D%B4%EC%B0%AC%EC%86%94/"},{"name":"이태원 클라쓰","slug":"이태원-클라쓰","link":"/tags/%EC%9D%B4%ED%83%9C%EC%9B%90-%ED%81%B4%EB%9D%BC%EC%93%B0/"},{"name":"슈퍼밴드","slug":"슈퍼밴드","link":"/tags/%EC%8A%88%ED%8D%BC%EB%B0%B4%EB%93%9C/"},{"name":"인생","slug":"인생","link":"/tags/%EC%9D%B8%EC%83%9D/"},{"name":"성장통","slug":"성장통","link":"/tags/%EC%84%B1%EC%9E%A5%ED%86%B5/"},{"name":"Microsoft Teams","slug":"Microsoft-Teams","link":"/tags/Microsoft-Teams/"},{"name":"Incoming Webhook","slug":"Incoming-Webhook","link":"/tags/Incoming-Webhook/"},{"name":"wrk","slug":"wrk","link":"/tags/wrk/"},{"name":"CLI","slug":"CLI","link":"/tags/CLI/"},{"name":"HTTP","slug":"HTTP","link":"/tags/HTTP/"},{"name":"benchmark","slug":"benchmark","link":"/tags/benchmark/"},{"name":"LuaJIT","slug":"LuaJIT","link":"/tags/LuaJIT/"},{"name":"테스트","slug":"테스트","link":"/tags/%ED%85%8C%EC%8A%A4%ED%8A%B8/"},{"name":"재택근무","slug":"재택근무","link":"/tags/%EC%9E%AC%ED%83%9D%EA%B7%BC%EB%AC%B4/"},{"name":"업무용 데스크","slug":"업무용-데스크","link":"/tags/%EC%97%85%EB%AC%B4%EC%9A%A9-%EB%8D%B0%EC%8A%A4%ED%81%AC/"},{"name":"코로나19","slug":"코로나19","link":"/tags/%EC%BD%94%EB%A1%9C%EB%82%9819/"},{"name":"개발환경","slug":"개발환경","link":"/tags/%EA%B0%9C%EB%B0%9C%ED%99%98%EA%B2%BD/"},{"name":"Spring Cloud Gateway","slug":"Spring-Cloud-Gateway","link":"/tags/Spring-Cloud-Gateway/"},{"name":"API Gateway","slug":"API-Gateway","link":"/tags/API-Gateway/"},{"name":"MSA","slug":"MSA","link":"/tags/MSA/"}],"categories":[{"name":"음악","slug":"음악","link":"/categories/%EC%9D%8C%EC%95%85/"},{"name":"개발","slug":"개발","link":"/categories/%EA%B0%9C%EB%B0%9C/"}]}